#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: e9e6afbfaacc8dc6b2bc415c32ef7860.pdb
; shader hash: e9e6afbfaacc8dc6b2bc415c32ef7860
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: VSMain
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "ImGuiAlloyBackend.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "VSMain", scope: !1, file: !1, line: 22, type: !18, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @VSMain)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PS_INPUT", file: !1, line: 12, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 14, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !20, file: !1, line: 15, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 16, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 3, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 3, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VS_INPUT", file: !1, line: 5, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !32, file: !1, line: 7, baseType: !25, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !32, file: !1, line: 8, baseType: !4, size: 128, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !32, file: !1, line: 9, baseType: !25, size: 64, align: 32, offset: 192)
!37 = !{!38, !62, !64}
!38 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@vertexBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !42, templateParams: !59)
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !41, file: !1, line: 3, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!59 = !{!13, !60, !61}
!60 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!61 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!62 = !DIGlobalVariable(name: "sampler0", linkageName: "\01?sampler0@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!64 = !DIGlobalVariable(name: "texture0", linkageName: "\01?texture0@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 20, size: 160, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !5)
!68 = !{i32 2, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!71 = !{!"ImGuiAlloyBackend.hlsl", !"cbuffer vertexBuffer : register(b0)\0D\0A{\0D\0A    float4x4 ProjectionMatrix;\0D\0A};\0D\0Astruct VS_INPUT\0D\0A{\0D\0A    float2 pos : POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0Astruct PS_INPUT\0D\0A{\0D\0A    float4 pos : SV_POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0ASamplerState sampler0 : register(s0);\0D\0ATexture2D texture0 : register(t0);\0D\0A\0D\0APS_INPUT VSMain(VS_INPUT input)\0D\0A{\0D\0A    PS_INPUT output;\0D\0A    output.pos = mul( ProjectionMatrix, float4(input.pos.xy, 0.f, 1.f));\0D\0A    output.col = input.col;\0D\0A    output.uv  = input.uv;\0D\0A    return output;\0D\0A}\0D\0A\0D\0Afloat4 PSMain(PS_INPUT input) : SV_Target\0D\0A{\0D\0A    float4 out_col = input.col * texture0.Sample(sampler0, input.uv);\0D\0A    return out_col;\0D\0A}"}
!72 = !{!"ImGuiAlloyBackend.hlsl"}
!73 = !{!"-E", !"VSMain", !"-T", !"vs_6_0", !"-Zi", !"-Qembed_debug"}
!74 = !{i32 1, i32 0}
!75 = !{i32 1, i32 8}
!76 = !{!"vs", i32 6, i32 0}
!77 = !{null, null, !78, null}
!78 = !{!79}
!79 = !{i32 0, %hostlayout.vertexBuffer* undef, !"vertexBuffer", i32 0, i32 0, i32 1, i32 64, null}
!80 = !{i32 0, %hostlayout.vertexBuffer undef, !81}
!81 = !{i32 64, !82}
!82 = !{i32 6, !"ProjectionMatrix", i32 2, !83, i32 3, i32 0, i32 7, i32 9}
!83 = !{i32 4, i32 4, i32 2}
!84 = !{i32 1, void ()* @VSMain, !85}
!85 = !{!86}
!86 = !{i32 0, !2, !2}
!87 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 0, i32 0, i32 16, i32 32, i32 64, i32 128, i32 256, i32 512]}
!88 = !{void ()* @VSMain, !"VSMain", !89, !77, null}
!89 = !{!90, !97, null}
!90 = !{!91, !94, !96}
!91 = !{i32 0, !"POSITION", i8 9, i8 0, !92, i8 0, i32 1, i8 2, i32 0, i8 0, !93}
!92 = !{i32 0}
!93 = !{i32 3, i32 3}
!94 = !{i32 1, !"COLOR", i8 9, i8 0, !92, i8 0, i32 1, i8 4, i32 1, i8 0, !95}
!95 = !{i32 3, i32 15}
!96 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !92, i8 0, i32 1, i8 2, i32 2, i8 0, !93}
!97 = !{!98, !99, !100}
!98 = !{i32 0, !"SV_Position", i8 9, i8 3, !92, i8 4, i32 1, i8 4, i32 0, i8 0, !95}
!99 = !{i32 1, !"COLOR", i8 9, i8 0, !92, i8 2, i32 1, i8 4, i32 1, i8 0, !95}
!100 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !92, i8 2, i32 1, i8 2, i32 2, i8 0, !93}
!101 = !DILocation(line: 22, column: 26, scope: !17)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "output", scope: !17, file: !1, line: 24, type: !20)
!103 = !DIExpression(DW_OP_bit_piece, 256, 32)
!104 = !DILocation(line: 24, column: 14, scope: !17)
!105 = !DIExpression(DW_OP_bit_piece, 288, 32)
!106 = !DIExpression(DW_OP_bit_piece, 128, 32)
!107 = !DIExpression(DW_OP_bit_piece, 160, 32)
!108 = !DIExpression(DW_OP_bit_piece, 192, 32)
!109 = !DIExpression(DW_OP_bit_piece, 224, 32)
