#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 466cd54011968886cd38d820aaa35ef2.pdb
; shader hash: 466cd54011968886cd38d820aaa35ef2
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: PSMain
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !31)
!1 = !DIFile(filename: "ImGuiAlloyBackend.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "PSMain", scope: !1, file: !1, line: 31, type: !5, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @PSMain)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 3, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 3, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 3, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PS_INPUT", file: !1, line: 12, size: 320, align: 32, elements: !20)
!20 = !{!21, !22, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 14, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !19, file: !1, line: 15, baseType: !7, size: 128, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !19, file: !1, line: 16, baseType: !24, size: 64, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 3, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 3, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 3, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!16, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!31 = !{!32, !56, !58}
!32 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@vertexBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 3, type: !33, isLocal: false, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 3, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 3, size: 512, align: 32, elements: !36, templateParams: !53)
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !35, file: !1, line: 3, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!53 = !{!16, !54, !55}
!54 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!55 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!56 = !DIGlobalVariable(name: "sampler0", linkageName: "\01?sampler0@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!58 = !DIGlobalVariable(name: "texture0", linkageName: "\01?texture0@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 20, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 20, size: 160, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !8)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!65 = !{!"ImGuiAlloyBackend.hlsl", !"cbuffer vertexBuffer : register(b0)\0D\0A{\0D\0A    float4x4 ProjectionMatrix;\0D\0A};\0D\0Astruct VS_INPUT\0D\0A{\0D\0A    float2 pos : POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0Astruct PS_INPUT\0D\0A{\0D\0A    float4 pos : SV_POSITION;\0D\0A    float4 col : COLOR0;\0D\0A    float2 uv  : TEXCOORD0;\0D\0A};\0D\0A\0D\0ASamplerState sampler0 : register(s0);\0D\0ATexture2D texture0 : register(t0);\0D\0A\0D\0APS_INPUT VSMain(VS_INPUT input)\0D\0A{\0D\0A    PS_INPUT output;\0D\0A    output.pos = mul( ProjectionMatrix, float4(input.pos.xy, 0.f, 1.f));\0D\0A    output.col = input.col;\0D\0A    output.uv  = input.uv;\0D\0A    return output;\0D\0A}\0D\0A\0D\0Afloat4 PSMain(PS_INPUT input) : SV_Target\0D\0A{\0D\0A    float4 out_col = input.col * texture0.Sample(sampler0, input.uv);\0D\0A    return out_col;\0D\0A}"}
!66 = !{!"ImGuiAlloyBackend.hlsl"}
!67 = !{!"-E", !"PSMain", !"-T", !"ps_6_0", !"-Zi", !"-Qembed_debug"}
!68 = !{i32 1, i32 0}
!69 = !{i32 1, i32 8}
!70 = !{!"ps", i32 6, i32 0}
!71 = !{!72, null, null, !75}
!72 = !{!73}
!73 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"texture0", i32 0, i32 0, i32 1, i32 2, i32 0, !74}
!74 = !{i32 0, i32 9}
!75 = !{!76}
!76 = !{i32 0, %struct.SamplerState* undef, !"sampler0", i32 0, i32 0, i32 1, i32 0, null}
!77 = !{i32 1, void ()* @PSMain, !78}
!78 = !{!79}
!79 = !{i32 0, !2, !2}
!80 = !{[12 x i32] [i32 10, i32 4, i32 0, i32 0, i32 0, i32 0, i32 1, i32 2, i32 4, i32 8, i32 15, i32 15]}
!81 = !{void ()* @PSMain, !"PSMain", !82, !71, null}
!82 = !{!83, !90, null}
!83 = !{!84, !86, !88}
!84 = !{i32 0, !"SV_Position", i8 9, i8 3, !85, i8 4, i32 1, i8 4, i32 0, i8 0, null}
!85 = !{i32 0}
!86 = !{i32 1, !"COLOR", i8 9, i8 0, !85, i8 2, i32 1, i8 4, i32 1, i8 0, !87}
!87 = !{i32 3, i32 15}
!88 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !85, i8 2, i32 1, i8 2, i32 2, i8 0, !89}
!89 = !{i32 3, i32 3}
!90 = !{!91}
!91 = !{i32 0, !"SV_Target", i8 9, i8 16, !85, i8 0, i32 1, i8 4, i32 0, i8 0, !87}
!92 = !DILocation(line: 33, column: 34, scope: !4)
!93 = !DILocation(line: 31, column: 24, scope: !4)
!94 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !4, file: !1, line: 31, type: !19)
!95 = !DIExpression(DW_OP_bit_piece, 128, 32)
!96 = !DIExpression(DW_OP_bit_piece, 160, 32)
!97 = !DIExpression(DW_OP_bit_piece, 192, 32)
!98 = !DIExpression(DW_OP_bit_piece, 256, 32)
!99 = !DIExpression(DW_OP_bit_piece, 288, 32)
!100 = !DIExpression(DW_OP_bit_piece, 224, 32)
!101 = !DILocation(line: 33, column: 32, scope: !4)
!102 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "out_col", scope: !4, file: !1, line: 33, type: !7)
!103 = !DIExpression(DW_OP_bit_piece, 0, 32)
!104 = !DILocation(line: 33, column: 12, scope: !4)
!105 = !DIExpression(DW_OP_bit_piece, 32, 32)
